# Lesson 2: Navigating the SQL SELECT Statement

# Navigating the SQL SELECT Statement

## Greetings!
Welcome to our second unit in the **"Learning SQL with Leo Messi"** course!

You have already journeyed through what databases are, explored the world of SQL, and understood the usage of MySQL. Remember how we wrote our first `SHOW TABLES` SQL command to list all the tables in a Messi database? That was your first step into SQL syntax!

SQL, unlike many programming languages, doesn't deal with logic or flow control; instead, it understands, manipulates, and retrieves data stored in databases in a structured manner.

---

## Getting to Know SELECT Syntax
In this lesson, we will cover the **SELECT** keyword. The syntax is straightforward.

### General Syntax:
```sql
SELECT column1, column2, ..., columnN FROM table_name;
```
In this syntax, you mention the column names that you want to retrieve, separated by commas. If you want to retrieve all columns, replace the column names with an asterisk (*).

---

## Querying the Database: Select All
Let's pull all the data from the **Clubs** table. We'll use the asterisk (*) symbol to do this.

```sql
SELECT * FROM Clubs;
```
This statement fetches all columns, along with their data, from the **Clubs** table. You would see `club_id`, `club_name`, `club_country`, and more, all displaying data from Lionel Messi's clubs table.

---

## SELECT for Specific Columns
Now, what if we want only specific information, such as the club name and club country? It's simple! We replace the asterisk with the required column names. Here's how:

```sql
SELECT club_name, club_country FROM Clubs;
```
In this example, we have fetched only the `club_name` and `club_country` columns from our **Clubs** table. Isn’t fine-tuning our query results exciting?

---

## Alias in SQL: Using the AS Keyword
Can we rename column names in the output for better understanding? Yes, we can! Thanks to SQL aliasing features. The **AS** keyword is used to rename a column or table with an alias.

```sql
SELECT club_name AS Name, club_country AS "Club Country" FROM Clubs;
```
In this statement, **AS** is used to rename `club_name` to **Name** and `club_country` to **Club Country** in our output. Notice that we use double quotes around **Club Country** because the new name contains spaces. This way, our result set has more comprehensible column names.

### Sample Output
The output of this query would be:

| Name                 | Club Country |
|----------------------|--------------|
| FC Barcelona         | Spain        |
| Paris Saint-Germain  | France       |

---

## Wrapping Up: Summary and Preparing for Practice
Let's recap what we've covered:
- `SELECT * FROM Clubs;` will fetch all columns.
- `SELECT club_name, club_country FROM Clubs;` will fetch specific columns.
- `SELECT club_name AS Name, club_country AS "Club Country" FROM Clubs;` will fetch specific columns and rename them in the output.

Practice these commands with different columns and aliases to gain a firm understanding of the **SELECT** statement. Don't worry if you make mistakes—they are stepping stones to mastering any new skill. Let's get to practice!

---

## End of Lesson Recap and Lookahead
That wraps up our second unit! You now understand the SQL syntax, the **SELECT** command, and the usage of the **AS** keyword to rename items in the output of your query.

The practice exercises that follow this lesson will further reinforce these concepts. Remember, the best way to learn is by doing. So, try writing and running your own SQL commands before you move on to the practice exercises.

Great job so far, and keep practicing!

## Selecting Specific Columns in SQL

You've previously learned how to fetch all columns from a table and select specific columns. Let's take it a step further. Your task is to modify the given SQL query to fetch club_id and club_name from the Clubs table instead of fetching all columns.

```sql
-- TODO: Select all columns from the Clubs table
SELECT * FROM Clubs;
```

To modify the SQL query to fetch only the `club_id` and `club_name` columns from the `Clubs` table, update it as follows:

```sql
-- Select club_id and club_name from the Clubs table
SELECT club_id, club_name FROM Clubs;
```

## Select and Rename Columns

Now that you've learned about selecting specific columns and using aliases, let's practice applying these concepts. Modify the given SQL query to fetch the club_name and club_country columns from the Clubs table and give them aliases Name and Club Country, respectively.

```sql
-- TODO: Select club_name and club_country with aliases
SELECT club_name, club_country FROM Clubs;

```

Here's the modified SQL query using aliases for `club_name` and `club_country`:

```sql
-- Select club_name and club_country with aliases
SELECT club_name AS Name, club_country AS "Club Country" FROM Clubs;
``` 

*Note*: The double quotes around "Club Country" ensure that the alias is interpreted as a single string, preserving the space.

## Fix the SQL Query

You've successfully practiced selecting specific columns from a table using the SELECT statement. Now, let's add a new twist. How about retrieving specific columns from the Clubs table but in a different order? You are tasked with fetching club_country and club_name, in that specific order, for all clubs from the Clubs table.

SELECT club_name, club_country FROM Clubs;

To change the order of the columns in your SELECT statement, you simply rearrange the columns in the desired order. Here's how you should write your query to fetch `club_country` first, followed by `club_name`:

```sql
SELECT club_country, club_name FROM Clubs;
```

### Explanation
- `SELECT` specifies the columns you want to retrieve.
- By placing `club_country` first and `club_name` second, you change the order of the output columns.

Let me know if you'd like further guidance or practice with SQL queries!

## Renaming Columns with SQL

In this task, you will practice selecting specific columns from a table with the extra challenge of renaming them. Your task is to select the season and trophies_won columns from the Seasons table and give them the aliases Season and Trophies Won, respectively.

Here's a sneak peek at a sample of the Seasons table.

season_id	season	trophies_won
1	04/05	1
2	05/06	2

-- TODO: Select season and trophies_won with aliases Season and Trophies Won
SELECT ________ AS ________, ________ AS ________ FROM Seasons;

You can use aliases to rename columns in your query like this:

```sql
SELECT season AS Season, trophies_won AS "Trophies Won" FROM Seasons;
```

### Explanation
- `AS` is used to provide an alias for the columns.
- **Season**: Renames the `season` column.
- **"Trophies Won"**: The alias for `trophies_won` is enclosed in quotes to handle the space between the words.

This will display the `season` and `trophies_won` columns with the new names "Season" and "Trophies Won" in the output. Let me know if you have more questions or need further assistance!

## Navigating Advanced SQL Queries

In this final task for the current section, you will use all the knowledge you have learned so far.

Your goal is to write an SQL query to retrieve the columns season, and trophies_won from the Seasons table. Additionally, rename these columns to Season and Trophies Won.

-- TODO: Fetch season, and trophies_won from the Seasons table, and rename them to Season and Trophies Won.

Here's the SQL query to retrieve the `season` and `trophies_won` columns from the `Seasons` table and rename them using aliases:

```sql
SELECT season AS Season, trophies_won AS "Trophies Won" FROM Seasons;
```

### Explanation
- **season AS Season**: Renames the `season` column to `Season`.
- **trophies_won AS "Trophies Won"**: Renames the `trophies_won` column to `Trophies Won`. The alias is enclosed in quotes to accommodate the space between the words.

This query will output the `season` and `trophies_won` columns with the specified aliases. Great work applying your SQL skills!